[View in Colaboratory](https://colab.research.google.com/github/chug2k/Titanic-Workshop/blob/master/CoderSchool_Workshop.ipynb)

In [4]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:



# Store the 'Survived' feature in a new variable and remove it from the dataset

# This stores the column 'Survived' in the variable outcomes
# This is also the response series (vector), y
outcomes = titanic['survived']

# df.drop() drops categories or rows
# In this case as axis=1, it's droppping the category 'survived'
# This are the features DataFrame (matrix) X
data = titanic.drop('survived', axis = 1)
data = data.drop('alive', axis = 1)

# Show the new dataset with 'survived' and 'alive' removed
data.head()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False
1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,False
2,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True
3,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,False
4,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,True

In [28]:
def accuracy_score(truth, pred):
    """ Returns accuracy score for input truth and predictions. """

    # Ensure that the number of predictions matches number of outcomes
    if len(truth) == len(pred):

        # Calculate and return the accuracy as a percent

        # {:2f}.format((truth == pred).mean()*100)
        # ":" represents format specification
        # "2f" represents 2 decimal places

        # (truth == pred).mean()*100
        return "Predictions have an accuracy of {:.2f}.".format((truth == pred).mean()*100)

    else:
        return "Number of predictions does not match number of outcomes!"

# Test the 'accuracy_score' function


def predict_everyone_survives():
  return pd.Series(np.ones(outcomes.size, dtype = int))

def predict_everyone_dies():
  return pd.Series(np.zeros(outcomes.size, dtype = int))
  

predictions = predict_everyone_survives()

print(accuracy_score(outcomes, predictions))

predictions = predict_everyone_dies()

print(accuracy_score(outcomes, predictions))

Predictions have an accuracy of 38.38.
Predictions have an accuracy of 61.62.